ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB1/inc/SI_EFM8UB1_Register_Enums.h
#define ADC0PWR_ADLPM__BMASK                 0x10 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__SHIFT                 0x04 ///< Low Power Mode Enable                            
#define ADC0PWR_ADLPM__LP_BUFFER_DISABLED    0x00 ///< Disable low power mode.                          
#define ADC0PWR_ADLPM__LP_BUFFER_ENABLED     0x10 ///< Enable low power mode (requires extended tracking
                                                  ///< time).                                           
                                                                                                        
#define ADC0PWR_ADMXLP__BMASK                0x20 ///< Mux and Reference Low Power Mode Enable          
#define ADC0PWR_ADMXLP__SHIFT                0x05 ///< Mux and Reference Low Power Mode Enable          
#define ADC0PWR_ADMXLP__LP_MUX_VREF_DISABLED 0x00 ///< Low power mode disabled.                         
#define ADC0PWR_ADMXLP__LP_MUX_VREF_ENABLED  0x20 ///< Low power mode enabled (SAR clock < 4 MHz).      
                                                                                                        
#define ADC0PWR_ADBIAS__FMASK                0xC0 ///< Bias Power Select                                
#define ADC0PWR_ADBIAS__SHIFT                0x06 ///< Bias Power Select                                
#define ADC0PWR_ADBIAS__MODE0                0x00 ///< Select bias current mode 0. Recommended to use   
                                                  ///< modes 1, 2, or 3.                                
#define ADC0PWR_ADBIAS__MODE1                0x40 ///< Select bias current mode 1 (SARCLK <= 16 MHz).   
#define ADC0PWR_ADBIAS__MODE2                0x80 ///< Select bias current mode 2.                      
#define ADC0PWR_ADBIAS__MODE3                0xC0 ///< Select bias current mode 3 (SARCLK <= 4 MHz).    
                                                                                                        
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xB9)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK         0x3F ///< Burst Mode Tracking Time                       
#define ADC0TK_ADTK__SHIFT         0x00 ///< Burst Mode Tracking Time                       
                                                                                            
#define ADC0TK_AD12SM__BMASK       0x80 ///< 12-Bit Sampling Mode                           
#define ADC0TK_AD12SM__SHIFT       0x07 ///< 12-Bit Sampling Mode                           
#define ADC0TK_AD12SM__SAMPLE_FOUR 0x00 ///< The ADC will re-track and sample the input four
                                        ///< times during a 12-bit conversion.              
#define ADC0TK_AD12SM__SAMPLE_ONCE 0x80 ///< The ADC will sample the input once at the      
                                        ///< beginning of each 12-bit conversion. The ADTK  
                                        ///< field can be set to 63 to maximize throughput. 
                                                                                            
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PFE0CN Enums (Prefetch Engine Control @ 0xC1)
//------------------------------------------------------------------------------
#define PFE0CN_FLRT__BMASK               0x10 ///< Flash Read Timing                             
#define PFE0CN_FLRT__SHIFT               0x04 ///< Flash Read Timing                             
#define PFE0CN_FLRT__SYSCLK_BELOW_25_MHZ 0x00 ///< SYSCLK < 25 MHz.                              
#define PFE0CN_FLRT__SYSCLK_BELOW_50_MHZ 0x10 ///< SYSCLK < 50 MHz.                              
                                                                                                 
#define PFE0CN_PFEN__BMASK               0x20 ///< Prefetch Enable                               
#define PFE0CN_PFEN__SHIFT               0x05 ///< Prefetch Enable                               
#define PFE0CN_PFEN__DISABLED            0x00 ///< Disable the prefetch engine (SYSCLK < 25 MHz).
#define PFE0CN_PFEN__ENABLED             0x20 ///< Enable the prefetch engine (SYSCLK > 25 MHz). 
                                                                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
