ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB1/inc/SI_EFM8UB1_Register_Enums.h
#define PSW_OV__BMASK       0x04 ///< Overflow Flag                                     
#define PSW_OV__SHIFT       0x02 ///< Overflow Flag                                     
#define PSW_OV__NOT_SET     0x00 ///< An overflow did not occur.                        
#define PSW_OV__SET         0x04 ///< An overflow occurred.                             
                                                                                        
#define PSW_RS__FMASK       0x18 ///< Register Bank Select                              
#define PSW_RS__SHIFT       0x03 ///< Register Bank Select                              
#define PSW_RS__BANK0       0x00 ///< Bank 0, Addresses 0x00-0x07                       
#define PSW_RS__BANK1       0x08 ///< Bank 1, Addresses 0x08-0x0F                       
#define PSW_RS__BANK2       0x10 ///< Bank 2, Addresses 0x10-0x17                       
#define PSW_RS__BANK3       0x18 ///< Bank 3, Addresses 0x18-0x1F                       
                                                                                        
#define PSW_F0__BMASK       0x20 ///< User Flag 0                                       
#define PSW_F0__SHIFT       0x05 ///< User Flag 0                                       
#define PSW_F0__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F0__SET         0x20 ///< Flag is set.                                      
                                                                                        
#define PSW_AC__BMASK       0x40 ///< Auxiliary Carry Flag                              
#define PSW_AC__SHIFT       0x06 ///< Auxiliary Carry Flag                              
#define PSW_AC__NOT_SET     0x00 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble did not occur.
#define PSW_AC__SET         0x40 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble occurred.     
                                                                                        
#define PSW_CY__BMASK       0x80 ///< Carry Flag                                        
#define PSW_CY__SHIFT       0x07 ///< Carry Flag                                        
#define PSW_CY__NOT_SET     0x00 ///< A carry (addition) or borrow (subtraction) did not
                                 ///< occur.                                            
#define PSW_CY__SET         0x80 ///< A carry (addition) or borrow (subtraction)        
                                 ///< occurred.                                         
                                                                                        
//------------------------------------------------------------------------------
// SP Enums (Stack Pointer @ 0x81)
//------------------------------------------------------------------------------
#define SP_SP__FMASK 0xFF ///< Stack Pointer
#define SP_SP__SHIFT 0x00 ///< Stack Pointer
                                            
//------------------------------------------------------------------------------
// CLKSEL Enums (Clock Select @ 0xA9)
//------------------------------------------------------------------------------
#define CLKSEL_CLKSL__FMASK           0x07 ///< Clock Source Select                             
#define CLKSEL_CLKSL__SHIFT           0x00 ///< Clock Source Select                             
#define CLKSEL_CLKSL__HFOSC0          0x00 ///< Clock derived from the Internal High Frequency  
                                           ///< Oscillator 0.                                   
#define CLKSEL_CLKSL__EXTOSC          0x01 ///< Clock derived from the External Oscillator      
                                           ///< circuit.                                        
#define CLKSEL_CLKSL__LFOSC           0x02 ///< Clock derived from the Internal Low-Frequency   
                                           ///< Oscillator.                                     
#define CLKSEL_CLKSL__HFOSC1          0x03 ///< Clock derived from the Internal High Frequency  
                                           ///< Oscillator 1.                                   
#define CLKSEL_CLKSL__HFOSC0_DIV_1P5  0x04 ///< Clock derived from the Internal High Frequency  
                                           ///< Oscillator 0, pre-scaled by 1.5.                
#define CLKSEL_CLKSL__HFOSC1_DIV_1P5  0x07 ///< Clock derived from the Internal High Frequency  
                                           ///< Oscillator 1, pre-scaled by 1.5.                
                                                                                                
#define CLKSEL_CLKDIV__FMASK          0x70 ///< Clock Source Divider                            
#define CLKSEL_CLKDIV__SHIFT          0x04 ///< Clock Source Divider                            
#define CLKSEL_CLKDIV__SYSCLK_DIV_1   0x00 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 1.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_2   0x10 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 2.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_4   0x20 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 4.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_8   0x30 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 8.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_16  0x40 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 16.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_32  0x50 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 32.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_64  0x60 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 64.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_128 0x70 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 128.                                         
                                                                                                
#define CLKSEL_DIVRDY__BMASK          0x80 ///< Clock Divider Ready                             
#define CLKSEL_DIVRDY__SHIFT          0x07 ///< Clock Divider Ready                             
#define CLKSEL_DIVRDY__NOT_READY      0x00 ///< Clock has not propagated through divider yet.   
#define CLKSEL_DIVRDY__READY          0x80 ///< Clock has propagated through divider.           
                                                                                                
//------------------------------------------------------------------------------
// CMP0CN0 Enums (Comparator 0 Control 0 @ 0x9B)
//------------------------------------------------------------------------------
#define CMP0CN0_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control            
#define CMP0CN0_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control            
#define CMP0CN0_CPHYN__DISABLED             0x00 ///< Negative Hysteresis disabled.                     
#define CMP0CN0_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.               
#define CMP0CN0_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.               
#define CMP0CN0_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                        
#define CMP0CN0_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control            
#define CMP0CN0_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control            
#define CMP0CN0_CPHYP__DISABLED             0x00 ///< Positive Hysteresis disabled.                     
#define CMP0CN0_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.               
#define CMP0CN0_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.               
#define CMP0CN0_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                        
#define CMP0CN0_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag                      
#define CMP0CN0_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag                      
#define CMP0CN0_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                 ///< flag was last cleared.                            
#define CMP0CN0_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.             
                                                                                                        
#define CMP0CN0_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CMP0CN0_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CMP0CN0_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                 ///< flag was last cleared.                            
#define CMP0CN0_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                        
#define CMP0CN0_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CMP0CN0_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CMP0CN0_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP0P < CP0N.                           
#define CMP0CN0_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP0P > CP0N.                           
                                                                                                        
#define CMP0CN0_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CMP0CN0_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CMP0CN0_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CMP0CN0_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                        
//------------------------------------------------------------------------------
// CMP0CN1 Enums (Comparator 0 Control 1 @ 0x99)
//------------------------------------------------------------------------------
#define CMP0CN1_DACLVL__FMASK   0x3F ///< Internal Comparator DAC Reference Level           
#define CMP0CN1_DACLVL__SHIFT   0x00 ///< Internal Comparator DAC Reference Level           
                                                                                            
#define CMP0CN1_CPINH__BMASK    0x80 ///< Output Inhibit                                    
#define CMP0CN1_CPINH__SHIFT    0x07 ///< Output Inhibit                                    
#define CMP0CN1_CPINH__DISABLED 0x00 ///< The comparator output will always reflect the     
                                     ///< input conditions.                                 
#define CMP0CN1_CPINH__ENABLED  0x80 ///< The comparator output will hold state any time the
                                     ///< PCA CEX2 channel is low.                          
                                                                                            
//------------------------------------------------------------------------------
// CMP0MD Enums (Comparator 0 Mode @ 0x9D)
//------------------------------------------------------------------------------
#define CMP0MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                            
#define CMP0MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                            
#define CMP0MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power      
                                             ///< Consumption)                                      
#define CMP0MD_CPMD__MODE1              0x01 ///< Mode 1                                            
#define CMP0MD_CPMD__MODE2              0x02 ///< Mode 2                                            
#define CMP0MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power       
                                             ///< Consumption)                                      
                                                                                                    
#define CMP0MD_INSL__FMASK              0x0C ///< Comparator Input Selection                        
#define CMP0MD_INSL__SHIFT              0x02 ///< Comparator Input Selection                        
#define CMP0MD_INSL__CMXP_CMXN          0x00 ///< Connect the comparator inputs directly to the     
                                             ///< signals selected in the CMP0MX register. CMP+ is  
                                             ///< selected by CMXP and CMP- is selected by CMXN. The
                                             ///< internal DAC is not active.                       
#define CMP0MD_INSL__CMXP_GND           0x04 ///< Connect the CMP+ input to the signal selected by  
                                             ///< CMXP, and CMP- is connected to GND. The internal  
                                             ///< DAC is not active.                                
#define CMP0MD_INSL__DAC_CMXN           0x08 ///< Connect the CMP+ input to the internal DAC output,
                                             ///< and CMP- is selected by CMXN. The internal DAC    
                                             ///< uses the signal specified by CMXP as its full-    
                                             ///< scale reference.                                  
#define CMP0MD_INSL__CMXP_DAC           0x0C ///< Connect the CMP- input to the internal DAC output,
                                             ///< and CMP+ is selected by CMXP. The internal DAC    
                                             ///< uses the signal specified by CMXN as its full-    
                                             ///< scale reference.                                  
                                                                                                    
#define CMP0MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable          
#define CMP0MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable          
#define CMP0MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled.       
#define CMP0MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.        
                                                                                                    
#define CMP0MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable           
#define CMP0MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable           
#define CMP0MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.        
#define CMP0MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.         
                                                                                                    
