ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB1/inc/SI_EFM8UB1_Register_Enums.h
#define IT01CF_IN0PL__BMASK       0x08 ///< INT0 Polarity             
#define IT01CF_IN0PL__SHIFT       0x03 ///< INT0 Polarity             
#define IT01CF_IN0PL__ACTIVE_LOW  0x00 ///< INT0 input is active low. 
#define IT01CF_IN0PL__ACTIVE_HIGH 0x08 ///< INT0 input is active high.
                                                                      
#define IT01CF_IN1SL__FMASK       0x70 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__SHIFT       0x04 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN1SL__P0_1        0x10 ///< Select P0.1.              
#define IT01CF_IN1SL__P0_2        0x20 ///< Select P0.2.              
#define IT01CF_IN1SL__P0_3        0x30 ///< Select P0.3.              
#define IT01CF_IN1SL__P0_4        0x40 ///< Select P0.4.              
#define IT01CF_IN1SL__P0_5        0x50 ///< Select P0.5.              
#define IT01CF_IN1SL__P0_6        0x60 ///< Select P0.6.              
#define IT01CF_IN1SL__P0_7        0x70 ///< Select P0.7.              
                                                                      
#define IT01CF_IN1PL__BMASK       0x80 ///< INT1 Polarity             
#define IT01CF_IN1PL__SHIFT       0x07 ///< INT1 Polarity             
#define IT01CF_IN1PL__ACTIVE_LOW  0x00 ///< INT1 input is active low. 
#define IT01CF_IN1PL__ACTIVE_HIGH 0x80 ///< INT1 input is active high.
                                                                      
//------------------------------------------------------------------------------
// FLKEY Enums (Flash Lock and Key @ 0xB7)
//------------------------------------------------------------------------------
#define FLKEY_FLKEY__FMASK    0xFF ///< Flash Lock and Key                             
#define FLKEY_FLKEY__SHIFT    0x00 ///< Flash Lock and Key                             
#define FLKEY_FLKEY__LOCKED   0x00 ///< Flash is write/erase locked.                   
#define FLKEY_FLKEY__FIRST    0x01 ///< The first key code has been written (0xA5).    
#define FLKEY_FLKEY__UNLOCKED 0x02 ///< Flash is unlocked (writes/erases allowed).     
#define FLKEY_FLKEY__DISABLED 0x03 ///< Flash writes/erases are disabled until the next
                                   ///< reset.                                         
#define FLKEY_FLKEY__KEY1     0xA5 ///< Flash writes and erases are enabled by writing 
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.   
#define FLKEY_FLKEY__KEY2     0xF1 ///< Flash writes and erases are enabled by writing 
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.   
                                                                                       
//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK          0x01 ///< Program Store Write Enable                      
#define PSCTL_PSWE__SHIFT          0x00 ///< Program Store Write Enable                      
#define PSCTL_PSWE__WRITE_DISABLED 0x00 ///< Writes to flash program memory disabled.        
#define PSCTL_PSWE__WRITE_ENABLED  0x01 ///< Writes to flash program memory enabled; the MOVX
                                        ///< write instruction targets flash memory.         
                                                                                             
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// HFO0CAL Enums (High Frequency Oscillator 0 Calibration @ 0xC7)
//------------------------------------------------------------------------------
#define HFO0CAL_HFO0CAL__FMASK 0xFF ///< Oscillator Calibration
#define HFO0CAL_HFO0CAL__SHIFT 0x00 ///< Oscillator Calibration
                                                               
//------------------------------------------------------------------------------
// HFO1CAL Enums (High Frequency Oscillator 1 Calibration @ 0xD6)
//------------------------------------------------------------------------------
#define HFO1CAL_HFO1CAL__FMASK 0x7F ///< Oscillator Calibration
#define HFO1CAL_HFO1CAL__SHIFT 0x00 ///< Oscillator Calibration
                                                               
//------------------------------------------------------------------------------
// HFOCN Enums (High Frequency Oscillator Control @ 0xEF)
//------------------------------------------------------------------------------
#define HFOCN_HFO0EN__BMASK    0x08 ///< HFOSC0 Oscillator Enable                        
#define HFOCN_HFO0EN__SHIFT    0x03 ///< HFOSC0 Oscillator Enable                        
#define HFOCN_HFO0EN__DISABLED 0x00 ///< Disable High Frequency Oscillator 0 (HFOSC0 will
                                    ///< still turn on if requested by any block in the  
                                    ///< device or selected as the SYSCLK source).       
#define HFOCN_HFO0EN__ENABLED  0x08 ///< Force High Frequency Oscillator 0 to run.       
                                                                                         
#define HFOCN_HFO1EN__BMASK    0x80 ///< HFOSC1 Oscillator Enable                        
#define HFOCN_HFO1EN__SHIFT    0x07 ///< HFOSC1 Oscillator Enable                        
#define HFOCN_HFO1EN__DISABLED 0x00 ///< Disable High Frequency Oscillator 1 (HFOSC1 will
                                    ///< still turn on if requested by any block in the  
                                    ///< device or selected as the SYSCLK source).       
#define HFOCN_HFO1EN__ENABLED  0x80 ///< Force High Frequency Oscillator 1 to run.       
                                                                                         
//------------------------------------------------------------------------------
// I2C0CN0 Enums (I2C0 Control @ 0xBA)
//------------------------------------------------------------------------------
#define I2C0CN0_BUSY__BMASK        0x01 ///< Busy                                             
#define I2C0CN0_BUSY__SHIFT        0x00 ///< Busy                                             
#define I2C0CN0_BUSY__NOT_SET      0x00 ///< Device will acknowledge an I2C master.           
#define I2C0CN0_BUSY__SET          0x01 ///< Device will not respond to an I2C master. All I2C
                                        ///< data sent to the device will be NACKed.          
                                                                                              
#define I2C0CN0_I2C0EN__BMASK      0x02 ///< I2C Enable                                       
#define I2C0CN0_I2C0EN__SHIFT      0x01 ///< I2C Enable                                       
#define I2C0CN0_I2C0EN__DISABLED   0x00 ///< Disable the I2C0 Slave module.                   
#define I2C0CN0_I2C0EN__ENABLED    0x02 ///< Enable the I2C0 Slave module.                    
                                                                                              
