ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB1/inc/SI_EFM8UB1_Register_Enums.h
#define EIP1H_PHWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control MSB           
#define EIP1H_PHWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control MSB           
#define EIP1H_PHWADC0__LOW   0x00 ///< ADC0 Window interrupt priority MSB set to low.                  
#define EIP1H_PHWADC0__HIGH  0x04 ///< ADC0 Window interrupt priority MSB set to high.                 
                                                                                                       
#define EIP1H_PHADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control MSB         
#define EIP1H_PHADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control MSB         
#define EIP1H_PHADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority MSB                 
                                  ///< set to low.                                                     
#define EIP1H_PHADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt priority MSB                 
                                  ///< set to high.                                                    
                                                                                                       
#define EIP1H_PHPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control MSB
#define EIP1H_PHPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control MSB
#define EIP1H_PHPCA0__LOW    0x00 ///< PCA0 interrupt priority MSB set to low.                         
#define EIP1H_PHPCA0__HIGH   0x10 ///< PCA0 interrupt priority MSB set to high.                        
                                                                                                       
#define EIP1H_PHCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control MSB                
#define EIP1H_PHCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control MSB                
#define EIP1H_PHCP0__LOW     0x00 ///< CP0 interrupt priority MSB set to low.                          
#define EIP1H_PHCP0__HIGH    0x20 ///< CP0 interrupt priority MSB set to high.                         
                                                                                                       
#define EIP1H_PHCP1__BMASK   0x40 ///< Comparator1 (CP1) Interrupt Priority Control MSB                
#define EIP1H_PHCP1__SHIFT   0x06 ///< Comparator1 (CP1) Interrupt Priority Control MSB                
#define EIP1H_PHCP1__LOW     0x00 ///< CP1 interrupt priority MSB set to low.                          
#define EIP1H_PHCP1__HIGH    0x40 ///< CP1 interrupt priority MSB set to high.                         
                                                                                                       
#define EIP1H_PHT3__BMASK    0x80 ///< Timer 3 Interrupt Priority Control MSB                          
#define EIP1H_PHT3__SHIFT    0x07 ///< Timer 3 Interrupt Priority Control MSB                          
#define EIP1H_PHT3__LOW      0x00 ///< Timer 3 interrupt priority MSB set to low.                      
#define EIP1H_PHT3__HIGH     0x80 ///< Timer 3 interrupt priority MSB set to high.                     
                                                                                                       
//------------------------------------------------------------------------------
// EIP2 Enums (Extended Interrupt Priority 2 @ 0xF4)
//------------------------------------------------------------------------------
#define EIP2_PUSB0__BMASK 0x01 ///< USB (USB0) Interrupt Priority Control LSB                 
#define EIP2_PUSB0__SHIFT 0x00 ///< USB (USB0) Interrupt Priority Control LSB                 
#define EIP2_PUSB0__LOW   0x00 ///< USB0 interrupt priority LSB set to low.                   
#define EIP2_PUSB0__HIGH  0x01 ///< USB0 interrupt priority LSB set to high.                  
                                                                                              
#define EIP2_PVBUS__BMASK 0x02 ///< VBUS and USB Charger Detect Interrupt Priority Control LSB
#define EIP2_PVBUS__SHIFT 0x01 ///< VBUS and USB Charger Detect Interrupt Priority Control LSB
#define EIP2_PVBUS__LOW   0x00 ///< VBUS / USB Charger Detect interrupt priority LSB          
                               ///< set to low.                                               
#define EIP2_PVBUS__HIGH  0x02 ///< VBUS / USB Charger Detect interrupt priority LSB          
                               ///< set to high.                                              
                                                                                              
#define EIP2_PS1__BMASK   0x04 ///< UART1 Interrupt Priority Control LSB                      
#define EIP2_PS1__SHIFT   0x02 ///< UART1 Interrupt Priority Control LSB                      
#define EIP2_PS1__LOW     0x00 ///< UART1 interrupt priority LSB set to low.                  
#define EIP2_PS1__HIGH    0x04 ///< UART1 interrupt priority LSB set to high.                 
                                                                                              
#define EIP2_PI2C0__BMASK 0x08 ///< I2C0 Slave Interrupt Priority Control LSB                 
#define EIP2_PI2C0__SHIFT 0x03 ///< I2C0 Slave Interrupt Priority Control LSB                 
#define EIP2_PI2C0__LOW   0x00 ///< I2C0 Slave interrupt priority LSB set to low.             
#define EIP2_PI2C0__HIGH  0x08 ///< I2C0 Slave interrupt priority LSB set to high.            
                                                                                              
#define EIP2_PT4__BMASK   0x10 ///< Timer 4 Interrupt Priority Control LSB                    
#define EIP2_PT4__SHIFT   0x04 ///< Timer 4 Interrupt Priority Control LSB                    
#define EIP2_PT4__LOW     0x00 ///< Timer 4 interrupt priority LSB set to low.                
#define EIP2_PT4__HIGH    0x10 ///< Timer 4 interrupt priority LSB set to high.               
                                                                                              
//------------------------------------------------------------------------------
// EIP2H Enums (Extended Interrupt Priority 2 High @ 0xF6)
//------------------------------------------------------------------------------
#define EIP2H_PHUSB0__BMASK 0x01 ///< USB (USB0) Interrupt Priority Control MSB                 
#define EIP2H_PHUSB0__SHIFT 0x00 ///< USB (USB0) Interrupt Priority Control MSB                 
#define EIP2H_PHUSB0__LOW   0x00 ///< USB0 interrupt priority MSB set to low.                   
#define EIP2H_PHUSB0__HIGH  0x01 ///< USB0 interrupt priority MSB set to high.                  
                                                                                                
#define EIP2H_PHVBUS__BMASK 0x02 ///< VBUS and USB Charger Detect Interrupt Priority Control MSB
#define EIP2H_PHVBUS__SHIFT 0x01 ///< VBUS and USB Charger Detect Interrupt Priority Control MSB
#define EIP2H_PHVBUS__LOW   0x00 ///< VBUS / USB Charger Detect interrupt priority MSB          
                                 ///< set to low.                                               
#define EIP2H_PHVBUS__HIGH  0x02 ///< VBUS / USB Charger Detect interrupt priority MSB          
                                 ///< set to high.                                              
                                                                                                
#define EIP2H_PHS1__BMASK   0x04 ///< UART1 Interrupt Priority Control MSB                      
#define EIP2H_PHS1__SHIFT   0x02 ///< UART1 Interrupt Priority Control MSB                      
#define EIP2H_PHS1__LOW     0x00 ///< UART1 interrupt priority MSB set to low.                  
#define EIP2H_PHS1__HIGH    0x04 ///< UART1 interrupt priority MSB set to high.                 
                                                                                                
#define EIP2H_PHI2C0__BMASK 0x08 ///< I2C0 Slave Interrupt Priority Control MSB                 
#define EIP2H_PHI2C0__SHIFT 0x03 ///< I2C0 Slave Interrupt Priority Control MSB                 
#define EIP2H_PHI2C0__LOW   0x00 ///< I2C0 Slave interrupt priority MSB set to low.             
#define EIP2H_PHI2C0__HIGH  0x08 ///< I2C0 Slave interrupt priority MSB set to high.            
                                                                                                
#define EIP2H_PHT4__BMASK   0x10 ///< Timer 4 Interrupt Priority Control MSB                    
#define EIP2H_PHT4__SHIFT   0x04 ///< Timer 4 Interrupt Priority Control MSB                    
#define EIP2H_PHT4__LOW     0x00 ///< Timer 4 interrupt priority MSB set to low.                
#define EIP2H_PHT4__HIGH    0x10 ///< Timer 4 interrupt priority MSB set to high.               
                                                                                                
//------------------------------------------------------------------------------
// IE Enums (Interrupt Enable @ 0xA8)
//------------------------------------------------------------------------------
#define IE_EX0__BMASK      0x01 ///< External Interrupt 0 Enable                       
#define IE_EX0__SHIFT      0x00 ///< External Interrupt 0 Enable                       
#define IE_EX0__DISABLED   0x00 ///< Disable external interrupt 0.                     
#define IE_EX0__ENABLED    0x01 ///< Enable interrupt requests generated by the INT0   
                                ///< input.                                            
                                                                                       
#define IE_ET0__BMASK      0x02 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__SHIFT      0x01 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__DISABLED   0x00 ///< Disable all Timer 0 interrupt.                    
#define IE_ET0__ENABLED    0x02 ///< Enable interrupt requests generated by the TF0    
                                ///< flag.                                             
                                                                                       
#define IE_EX1__BMASK      0x04 ///< External Interrupt 1 Enable                       
#define IE_EX1__SHIFT      0x02 ///< External Interrupt 1 Enable                       
#define IE_EX1__DISABLED   0x00 ///< Disable external interrupt 1.                     
#define IE_EX1__ENABLED    0x04 ///< Enable interrupt requests generated by the INT1   
                                ///< input.                                            
                                                                                       
#define IE_ET1__BMASK      0x08 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__SHIFT      0x03 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__DISABLED   0x00 ///< Disable all Timer 1 interrupt.                    
#define IE_ET1__ENABLED    0x08 ///< Enable interrupt requests generated by the TF1    
                                ///< flag.                                             
                                                                                       
#define IE_ES0__BMASK      0x10 ///< UART0 Interrupt Enable                            
#define IE_ES0__SHIFT      0x04 ///< UART0 Interrupt Enable                            
#define IE_ES0__DISABLED   0x00 ///< Disable UART0 interrupt.                          
#define IE_ES0__ENABLED    0x10 ///< Enable UART0 interrupt.                           
                                                                                       
#define IE_ET2__BMASK      0x20 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__SHIFT      0x05 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__DISABLED   0x00 ///< Disable Timer 2 interrupt.                        
#define IE_ET2__ENABLED    0x20 ///< Enable interrupt requests generated by the TF2L or
                                ///< TF2H flags.                                       
                                                                                       
#define IE_ESPI0__BMASK    0x40 ///< SPI0 Interrupt Enable                             
#define IE_ESPI0__SHIFT    0x06 ///< SPI0 Interrupt Enable                             
#define IE_ESPI0__DISABLED 0x00 ///< Disable all SPI0 interrupts.                      
#define IE_ESPI0__ENABLED  0x40 ///< Enable interrupt requests generated by SPI0.      
                                                                                       
#define IE_EA__BMASK       0x80 ///< All Interrupts Enable                             
#define IE_EA__SHIFT       0x07 ///< All Interrupts Enable                             
#define IE_EA__DISABLED    0x00 ///< Disable all interrupt sources.                    
#define IE_EA__ENABLED     0x80 ///< Enable each interrupt according to its individual 
                                ///< mask setting.                                     
                                                                                       
//------------------------------------------------------------------------------
// IP Enums (Interrupt Priority @ 0xB8)
//------------------------------------------------------------------------------
#define IP_PX0__BMASK   0x01 ///< External Interrupt 0 Priority Control LSB                        
#define IP_PX0__SHIFT   0x00 ///< External Interrupt 0 Priority Control LSB                        
#define IP_PX0__LOW     0x00 ///< External Interrupt 0 priority LSB set to low.                    
#define IP_PX0__HIGH    0x01 ///< External Interrupt 0 priority LSB set to high.                   
                                                                                                   
#define IP_PT0__BMASK   0x02 ///< Timer 0 Interrupt Priority Control LSB                           
#define IP_PT0__SHIFT   0x01 ///< Timer 0 Interrupt Priority Control LSB                           
#define IP_PT0__LOW     0x00 ///< Timer 0 interrupt priority LSB set to low.                       
#define IP_PT0__HIGH    0x02 ///< Timer 0 interrupt priority LSB set to high.                      
                                                                                                   
