ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB1/inc/SI_EFM8UB1_Register_Enums.h
#define UART1LIN_BREAKDN__BMASK      0x40 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__SHIFT      0x06 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__NOT_SET    0x00 ///< A LIN break has not been detected.                
#define UART1LIN_BREAKDN__BREAK      0x40 ///< A LIN break was detected since the flag was last  
                                          ///< cleared.                                          
                                                                                                 
#define UART1LIN_AUTOBDE__BMASK      0x80 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__SHIFT      0x07 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__DISABLED   0x00 ///< Autobaud is not enabled.                          
#define UART1LIN_AUTOBDE__ENABLED    0x80 ///< Autobaud is enabled.                              
                                                                                                 
//------------------------------------------------------------------------------
// SBUF0 Enums (UART0 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF0_SBUF0__FMASK 0xFF ///< Serial Data Buffer
#define SBUF0_SBUF0__SHIFT 0x00 ///< Serial Data Buffer
                                                       
//------------------------------------------------------------------------------
// SCON0 Enums (UART0 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON0_RI__BMASK             0x01 ///< Receive Interrupt Flag                           
#define SCON0_RI__SHIFT             0x00 ///< Receive Interrupt Flag                           
#define SCON0_RI__NOT_SET           0x00 ///< New data has not been received by UART0.         
#define SCON0_RI__SET               0x01 ///< UART0 received one or more data bytes.           
                                                                                               
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__NOT_SET          0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET              0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__NOT_SET          0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET              0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// CLKREC Enums (USB0 Clock Recovery Control @ 0x0F)
//------------------------------------------------------------------------------
#define CLKREC_CRLOW__BMASK      0x20 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__SHIFT      0x05 ///< Low Speed Clock Recovery Mode               
#define CLKREC_CRLOW__FULL_SPEED 0x00 ///< Full Speed Mode.                            
#define CLKREC_CRLOW__LOW_SPEED  0x20 ///< Low Speed Mode.                             
                                                                                       
#define CLKREC_CRSSEN__BMASK     0x40 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__SHIFT     0x06 ///< Clock Recovery Single Step                  
#define CLKREC_CRSSEN__DISABLED  0x00 ///< Disable single-step mode (normal calibration
                                      ///< mode).                                      
#define CLKREC_CRSSEN__ENABLED   0x40 ///< Enable single-step mode.                    
                                                                                       
#define CLKREC_CRE__BMASK        0x80 ///< Clock Recovery Enable                       
#define CLKREC_CRE__SHIFT        0x07 ///< Clock Recovery Enable                       
#define CLKREC_CRE__DISABLED     0x00 ///< Disable clock recovery.                     
#define CLKREC_CRE__ENABLED      0x80 ///< Enable clock recovery.                      
                                                                                       
//------------------------------------------------------------------------------
// CMIE Enums (USB0 Common Interrupt Enable @ 0x0B)
//------------------------------------------------------------------------------
#define CMIE_SUSINTE__BMASK    0x01 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__SHIFT    0x00 ///< Suspend Interrupt Enable       
#define CMIE_SUSINTE__DISABLED 0x00 ///< Disable suspend interrupts.    
#define CMIE_SUSINTE__ENABLED  0x01 ///< Enable suspend interrupts.     
                                                                        
#define CMIE_RSUINTE__BMASK    0x02 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__SHIFT    0x01 ///< Resume Interrupt Enable        
#define CMIE_RSUINTE__DISABLED 0x00 ///< Disable resume interrupts.     
#define CMIE_RSUINTE__ENABLED  0x02 ///< Enable resume interrupts.      
                                                                        
#define CMIE_RSTINTE__BMASK    0x04 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__SHIFT    0x02 ///< Reset Interrupt Enable         
#define CMIE_RSTINTE__DISABLED 0x00 ///< Disable reset interrupts.      
#define CMIE_RSTINTE__ENABLED  0x04 ///< Enable reset interrupts.       
                                                                        
